SiriusWolpha/Luminance_Project/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '101', peripheral: LPUART1, signal: RX, pin_signal: GPIO_AD_B0_07}
  - {pin_num: '105', peripheral: LPUART1, signal: TX, pin_signal: GPIO_AD_B0_06}
  - {pin_num: '120', peripheral: GPIO3, signal: 'gpio_io, 04', pin_signal: GPIO_EMC_36, identifier: S_DC, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '117', peripheral: GPIO3, signal: 'gpio_io, 07', pin_signal: GPIO_EMC_39, identifier: S_RESET, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '122', peripheral: LPSPI4, signal: SDO, pin_signal: GPIO_EMC_34, identifier: S_MOSI, direction: OUTPUT}
  - {pin_num: '121', peripheral: LPSPI4, signal: SDI, pin_signal: GPIO_EMC_35, identifier: S_MISO, direction: INPUT}
  - {pin_num: '124', peripheral: LPSPI4, signal: SCK, pin_signal: GPIO_EMC_32, identifier: S_CLK, direction: OUTPUT}
  - {pin_num: '123', peripheral: LPSPI4, signal: PCS0, pin_signal: GPIO_EMC_33, identifier: S_CS, direction: OUTPUT}
  - {pin_num: '126', peripheral: GPIO2, signal: 'gpio_io, 30', pin_signal: GPIO_EMC_30, identifier: S_PENIRQ, direction: INPUT, gpio_interrupt: kGPIO_IntFallingEdge}
  - {pin_num: '119', peripheral: LPSPI4, signal: PCS2, pin_signal: GPIO_EMC_37, identifier: S_TOUCH_CS, direction: OUTPUT}
  - {pin_num: '125', peripheral: GPIO2, signal: 'gpio_io, 31', pin_signal: GPIO_EMC_31, identifier: S_LED, direction: OUTPUT, gpio_init_state: 'false'}
  - {pin_num: '15', peripheral: GPIO2, signal: 'gpio_io, 03', pin_signal: GPIO_EMC_03, identifier: SDA, direction: OUTPUT, gpio_init_state: 'true', software_input_on: Enable}
  - {pin_num: '16', peripheral: GPIO2, signal: 'gpio_io, 02', pin_signal: GPIO_EMC_02, identifier: SCL, direction: OUTPUT, gpio_init_state: 'true', software_input_on: Enable}
  - {pin_num: '18', peripheral: GPIO2, signal: 'gpio_io, 00', pin_signal: GPIO_EMC_00, direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           

  /* GPIO configuration of SEMC_D0 on GPIO_EMC_00 (pin 18) */
  gpio_pin_config_t SEMC_D0_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_00 (pin 18) */
  GPIO_PinInit(GPIO2, 0U, &SEMC_D0_config);

  /* GPIO configuration of SCL on GPIO_EMC_02 (pin 16) */
  gpio_pin_config_t SCL_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_02 (pin 16) */
  GPIO_PinInit(GPIO2, 2U, &SCL_config);

  /* GPIO configuration of SDA on GPIO_EMC_03 (pin 15) */
  gpio_pin_config_t SDA_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_03 (pin 15) */
  GPIO_PinInit(GPIO2, 3U, &SDA_config);

  /* GPIO configuration of S_PENIRQ on GPIO_EMC_30 (pin 126) */
  gpio_pin_config_t S_PENIRQ_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntFallingEdge
  };
  /* Initialize GPIO functionality on GPIO_EMC_30 (pin 126) */
  GPIO_PinInit(GPIO2, 30U, &S_PENIRQ_config);
  /* Enable GPIO pin interrupt on GPIO_EMC_30 (pin 126) */
  GPIO_PortEnableInterrupts(GPIO2, 1U << 30U);

  /* GPIO configuration of S_LED on GPIO_EMC_31 (pin 125) */
  gpio_pin_config_t S_LED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_31 (pin 125) */
  GPIO_PinInit(GPIO2, 31U, &S_LED_config);

  /* GPIO configuration of S_DC on GPIO_EMC_36 (pin 120) */
  gpio_pin_config_t S_DC_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_36 (pin 120) */
  GPIO_PinInit(GPIO3, 4U, &S_DC_config);

  /* GPIO configuration of S_RESET on GPIO_EMC_39 (pin 117) */
  gpio_pin_config_t S_RESET_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_39 (pin 117) */
  GPIO_PinInit(GPIO3, 7U, &S_RESET_config);

  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_06_LPUART1_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_07_LPUART1_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_00_GPIO2_IO00, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_02_GPIO2_IO02, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_03_GPIO2_IO03, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_30_GPIO2_IO30, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_31_GPIO2_IO31, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_32_LPSPI4_SCK, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_33_LPSPI4_PCS0, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_34_LPSPI4_SDO, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_35_LPSPI4_SDI, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_36_GPIO3_IO04, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_37_LPSPI4_PCS2, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_39_GPIO3_IO07, 0U); 
}

